#+TITLE:Sight Agenda
#+TODO: TODO(t) WAIT(w@/!) | CANCELLED(c@) DONE(d) OUT(o)

* 2020

** TODO Standup Mon
   SCHEDULED: <2020-06-22 Mon 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-06-15 Mon 13:30]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-06-15 Mon 10:00]--[2020-06-15 Mon 10:30] =>  0:30
   CLOCK: [2020-06-08 Mon 10:00]--[2020-06-08 Mon 10:30] =>  0:30
   CLOCK: [2020-06-01 Mon 10:00]--[2020-06-01 Mon 10:30] =>  0:30
   CLOCK: [2020-05-18 Mon 10:00]--[2020-05-18 Mon 10:30] =>  0:30
   CLOCK: [2020-04-27 Mon 09:30]--[2020-04-27 Mon 10:30] =>  1:00
   CLOCK: [2020-05-04 Mon 10:00]--[2020-05-04 Mon 10:30] =>  0:30
   CLOCK: [2020-05-11 Mon 10:00]--[2020-05-11 Mon 10:30] =>  0:30
   :END:

** TODO Standup Tue
   SCHEDULED: <2020-06-23 Tue 11:00 ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-06-21 Sun 21:52]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-06-16 Tue 10:00]--[2020-06-16 Tue 10:30] =>  0:30
   CLOCK: [2020-06-09 Tue 10:00]--[2020-06-09 Tue 10:30] =>  0:30
   CLOCK: [2020-06-02 Tue 10:00]--[2020-06-02 Tue 10:30] =>  0:30
   CLOCK: [2020-05-26 Tue 10:00]--[2020-05-26 Tue 10:30] =>  0:30
   CLOCK: [2020-05-19 Tue 10:00]--[2020-05-19 Tue 10:30] =>  0:30
   CLOCK: [2020-05-05 Tue 10:00]--[2020-05-05 Tue 10:30] =>  0:30
   CLOCK: [2020-05-12 Tue 10:00]--[2020-05-12 Tue 10:30] =>  0:30
   :END:

** TODO Standup Wed
   SCHEDULED: <2020-06-24 Wed ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-06-21 Sun 21:53]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-06-17 Wed 10:00]--[2020-06-17 Wed 10:30] =>  0:30
   CLOCK: [2020-06-03 Wed 10:00]--[2020-06-03 Wed 10:30] =>  0:30
   CLOCK: [2020-05-27 Wed 10:00]--[2020-05-27 Wed 10:30] =>  0:30
   CLOCK: [2020-05-20 Wed 10:00]--[2020-05-20 Wed 10:30] =>  0:30
   CLOCK: [2020-05-13 Wed 10:00]--[2020-05-13 Wed 10:30] =>  0:30
   CLOCK: [2020-05-06 Wed 10:00]--[2020-05-06 Wed 10:30] =>  0:30
   CLOCK: [2020-04-29 Wed 10:00]--[2020-04-29 Wed 10:30] =>  0:30
   :END:

** TODO Standup Thu
   SCHEDULED: <2020-06-25 Thu ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-06-21 Sun 21:53]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-06-18 Thu 10:00]--[2020-06-18 Thu 10:30] =>  0:30
   CLOCK: [2020-06-11 Thu 10:00]--[2020-06-11 Thu 10:30] =>  0:30
   CLOCK: [2020-05-28 Thu 10:00]--[2020-05-28 Thu 10:30] =>  0:30
   CLOCK: [2020-06-04 Thu 10:00]--[2020-06-04 Thu 10:30] =>  0:30
   CLOCK: [2020-05-21 Thu 10:00]--[2020-05-21 Thu 10:30] =>  0:30
   CLOCK: [2020-05-14 Thu 10:00]--[2020-05-14 Thu 10:30] =>  0:30
   CLOCK: [2020-05-07 Thu 10:00]--[2020-05-07 Thu 10:30] =>  0:30
   CLOCK: [2020-04-30 Thu 10:00]--[2020-04-30 Thu 10:30] =>  0:30
   :END:

** TODO Standup Fri
   SCHEDULED: <2020-06-26 Fri ++1w>
   :PROPERTIES:
   :LAST_REPEAT: [2020-06-21 Sun 21:53]
   :LOGGING:  NONE
   :END:
   :LOGBOOK:
   CLOCK: [2020-06-19 Fri 10:00]--[2020-06-19 Fri 10:30] =>  0:30
   CLOCK: [2020-06-12 Fri 10:00]--[2020-06-12 Fri 10:30] =>  0:30
   CLOCK: [2020-06-05 Fri 10:00]--[2020-06-05 Fri 10:30] =>  0:30
   CLOCK: [2020-05-29 Fri 10:00]--[2020-05-29 Fri 10:30] =>  0:30
   CLOCK: [2020-05-22 Fri 10:00]--[2020-05-22 Fri 10:30] =>  0:30
   CLOCK: [2020-05-15 Fri 10:00]--[2020-05-15 Fri 10:30] =>  0:30
   CLOCK: [2020-05-08 Fri 10:00]--[2020-05-08 Fri 10:30] =>  0:30
   CLOCK: [2020-05-01 Fri 10:00]--[2020-05-01 Fri 10:30] =>  0:30
   :END:


** Week 17

   #+BEGIN: clocktable :block lastweek :maxlevel 3
   #+CAPTION: Clock summary at [2020-05-04 Mon 06:02], for week 2020-W18.
   | Headline                            | Time      |         |       |
   |-------------------------------------+-----------+---------+-------|
   | *Total time*                        | *1d 7:00* |         |       |
   |-------------------------------------+-----------+---------+-------|
   | 2020                                | 1d 7:00   |         |       |
   | \_  Standup Mon                     |           |    1:00 |       |
   | \_  Standup Wed                     |           |    0:30 |       |
   | \_  Standup Thu                     |           |    0:30 |       |
   | \_  Standup Fri                     |           |    0:30 |       |
   | \_  Week 17                         |           | 1d 4:30 |       |
   | \_    examine web hosting solutions |           |         |  3:00 |
   | \_    initialize dotnet mvc project |           |         |  3:00 |
   | \_    develop basic makefile        |           |         |  1:00 |
   | \_    base html page layout         |           |         | 14:00 |
   | \_    about us page                 |           |         |  7:30 |
   #+END

*** DONE jones brennan cogent view overview                          :ATTACH:
    :PROPERTIES:
    :ID:       64615703-422b-461f-9bf4-a8e8815f1726
    :END:

*** DONE examine web hosting solutions
    :LOGBOOK:
    CLOCK: [2020-04-27 Mon 10:30]--[2020-04-27 Mon 13:30] =>  3:00
    :END:

*** DONE initialize dotnet mvc project
    :LOGBOOK:
    CLOCK: [2020-04-28 Tue 12:30]--[2020-04-28 Tue 15:30] =>  3:00
    :END:

*** DONE develop basic makefile
    :LOGBOOK:
    CLOCK: [2020-04-29 Wed 09:00]--[2020-04-29 Wed 10:00] =>  1:00
    :END:

*** DONE base html page layout
    :LOGBOOK:
    CLOCK: [2020-04-29 Wed 10:30]--[2020-04-29 Wed 16:00] =>  6:00
    CLOCK: [2020-04-30 Thu 07:30]--[2020-04-30 Thu 10:00] =>  2:30
    CLOCK: [2020-04-30 Thu 10:30]--[2020-04-30 Thu 16:30] =>  4:30
    :END:

*** DONE about us page
    :LOGBOOK:
    CLOCK: [2020-05-01 Fri 8:00]--[2020-05-01 Fri 10:00] =>  2:00
    CLOCK: [2020-05-01 Fri 10:30]--[2020-05-01 Fri 12:00] =>  1:30
    CLOCK: [2020-05-03 Sun 12:00]--[2020-05-03 Sun 16:00] =>  4:00
    :END:


** Week 18

   #+BEGIN: clocktable :block week :maxlevel 3
   #+CAPTION: Clock summary at [2020-05-10 Sun 20:37], for week 2020-W19.
   | Headline                                | Time       |          |      |
   |-----------------------------------------+------------+----------+------|
   | *Total time*                            | *1d 16:00* |          |      |
   |-----------------------------------------+------------+----------+------|
   | 2020                                    | 1d 16:00   |          |      |
   | \_  Standup Mon                         |            |     0:30 |      |
   | \_  Standup Tue                         |            |     0:30 |      |
   | \_  Standup Wed                         |            |     0:30 |      |
   | \_  Standup Thu                         |            |     0:30 |      |
   | \_  Standup Fri                         |            |     0:30 |      |
   | \_  Week 18                             |            | 1d 13:30 |      |
   | \_    local db context                  |            |          | 9:30 |
   | \_    identity server                   |            |          | 7:00 |
   | \_    account management front end      |            |          | 5:30 |
   | \_    display "logged-in" status on bar |            |          | 1:30 |
   | \_    fix logout                        |            |          | 6:00 |
   | \_    fix email sender                  |            |          | 0:30 |
   | \_    start station page                |            |          | 7:30 |
   #+END

*** DONE local db context
    :LOGBOOK:
    CLOCK: [2020-05-04 Mon 08:00]--[2020-05-04 Mon 10:00] =>  2:00
    CLOCK: [2020-05-04 Mon 10:30]--[2020-05-04 Mon 16:00] =>  5:30
    CLOCK: [2020-05-05 Tue 08:00]--[2020-05-05 Tue 10:00] =>  2:00
    :END:

*** DONE identity server
    :LOGBOOK:
    CLOCK: [2020-05-06 Wed 08:00]--[2020-05-06 Wed 10:00] =>  2:00
    CLOCK: [2020-05-05 Tue 10:30]--[2020-05-05 Tue 15:30] =>  5:00
    :END:

*** DONE account management front end
     :LOGBOOK:
     CLOCK: [2020-05-06 Wed 10:30]--[2020-05-06 Wed 16:00] =>  5:30
     :END:

*** DONE display "logged-in" status on bar
    :LOGBOOK:
    CLOCK: [2020-05-07 Thu 08:00]--[2020-05-07 Thu 9:30] =>  1:30
    :END:

*** DONE fix logout
    :LOGBOOK:
    CLOCK: [2020-05-07 Thu 10:30]--[2020-05-07 Thu 16:00] =>  5:30
    CLOCK: [2020-05-07 Thu 09:30]--[2020-05-07 Thu 10:00] =>  0:30
    :END:

*** CANCELLED fix email sender
    - State "CANCELLED"  from "TODO"       [2020-05-08 Fri 10:00] \\
      split into more issues
    :LOGBOOK:
    CLOCK: [2020-05-08 Fri 09:30]--[2020-05-08 Fri 10:00] =>  0:30
    :END:

*** DONE start station page
    :LOGBOOK:
    CLOCK: [2020-05-10 Sun 15:00]--[2020-05-10 Sun 19:30] =>  4:30
    CLOCK: [2020-05-08 Fri 10:30]--[2020-05-08 Fri 13:30] =>  3:00
    :END:


** Week 19

   #+BEGIN: clocktable :block week :maxlevel 3
   #+CAPTION: Clock summary at [2020-05-17 Sun 12:34], for week 2020-W20.
   | Headline           | Time       |          |          |
   |--------------------+------------+----------+----------|
   | *Total time*       | *1d 16:00* |          |          |
   |--------------------+------------+----------+----------|
   | 2020               | 1d 16:00   |          |          |
   | \_  Standup Mon    |            |     0:30 |          |
   | \_  Standup Tue    |            |     0:30 |          |
   | \_  Standup Wed    |            |     0:30 |          |
   | \_  Standup Thu    |            |     0:30 |          |
   | \_  Standup Fri    |            |     0:30 |          |
   | \_  Week 19        |            | 1d 13:30 |          |
   | \_    station page |            |          | 1d 13:30 |
   #+END

*** OUT station page
    :LOGBOOK:
    CLOCK: [2020-05-17 Sun 8:00]--[2020-05-17 Sun 13:00] =>  5:00
    CLOCK: [2020-05-11 Mon 7:30]--[2020-05-11 Mon 10:00] =>  2:30
    CLOCK: [2020-05-11 Mon 10:30]--[2020-05-11 Mon 13:30] =>  3:00
    CLOCK: [2020-05-12 Tue 8:30]--[2020-05-12 Tue 10:00] =>  1:30
    CLOCK: [2020-05-12 Tue 10:30]--[2020-05-12 Tue 16:00] =>  5:30
    CLOCK: [2020-05-13 Wed 7:30]--[2020-05-13 Wed 10:00] =>  2:30
    CLOCK: [2020-05-13 Wed 10:30]--[2020-05-13 Wed 15:30] =>  5:00
    CLOCK: [2020-05-14 Thu 7:30]--[2020-05-14 Thu 10:00] =>  2:30
    CLOCK: [2020-05-14 Thu 10:30]--[2020-05-14 Thu 17:00] =>  6:30
    CLOCK: [2020-05-15 Fri 9:00]--[2020-05-15 Fri 10:00] =>  1:00
    CLOCK: [2020-05-15 Fri 10:30]--[2020-05-15 Fri 13:00] =>  2:30
    :END:


*** OUT smtp server


** Week 20

   #+BEGIN: clocktable :block week :maxlevel 3
   #+CAPTION: Clock summary at [2020-05-24 Sun 12:57], for week 2020-W21.
   | Headline                             | Time       |          |       |
   |--------------------------------------+------------+----------+-------|
   | *Total time*                         | *1d 16:00* |          |       |
   |--------------------------------------+------------+----------+-------|
   | 2020                                 | 1d 16:00   |          |       |
   | \_  Standup Mon                      |            |     0:30 |       |
   | \_  Standup Tue                      |            |     0:30 |       |
   | \_  Standup Wed                      |            |     0:30 |       |
   | \_  Standup Thu                      |            |     0:30 |       |
   | \_  Standup Fri                      |            |     0:30 |       |
   | \_  Week 20                          |            | 1d 13:30 |       |
   | \_    station page                   |            |          | 12:30 |
   | \_    host on managed linux server   |            |          |  0:30 |
   | \_    host on managed windows server |            |          |  9:00 |
   | \_    host on linux vps server       |            |          | 11:00 |
   | \_    ssl and https redirection      |            |          |  4:30 |
   #+END

*** DONE station page
    :LOGBOOK:
    CLOCK: [2020-05-24 Sun 10:00]--[2020-05-24 Sun 12:30] =>  2:30
    CLOCK: [2020-05-19 Tue 07:00]--[2020-05-19 Tue 10:00] =>  0:00
    CLOCK: [2020-05-18 Mon 10:30]--[2020-05-18 Mon 15:00] =>  4:30
    CLOCK: [2020-05-18 Mon 7:30]--[2020-05-18 Mon 10:00] =>  2:30
    :END:

*** CANCELLED host on managed linux server
    :LOGBOOK:
    CLOCK: [2020-05-19 Tue 10:30]--[2020-05-19 Tue 11:00] =>  1:00
    :END:

*** CANCELLED host on managed windows server
    :LOGBOOK:
    CLOCK: [2020-05-19 Tue 11:00]--[2020-05-19 Sun 16:30] =>  5:30
    CLOCK: [2020-05-20 Wed 07:00]--[2020-05-20 Wed 10:00] =>  3:00
    CLOCK: [2020-05-20 Wed 10:30]--[2020-05-20 Wed 11:00] =>  1:00
    :END:

*** DONE host on linux vps server
    :LOGBOOK:
    CLOCK: [2020-05-20 Wed 11:00]--[2020-05-20 Wed 18:30] =>  7:30
    CLOCK: [2020-05-21 Thu 10:30]--[2020-05-21 Thu 11:00] =>  1:00
    CLOCK: [2020-05-21 Thu 07:00]--[2020-05-21 Thu 10:00] =>  3:00
    :END:

*** DONE ssl and https redirection
    :LOGBOOK:
    CLOCK: [2020-05-22 Fri 08:00]--[2020-05-22 Fri 10:00] =>  2:00
    CLOCK: [2020-05-22 Fri 10:30]--[2020-05-22 Fri 13:00] =>  2:00
    :END:

*** OUT smtp server


** Week 21

   #+BEGIN: clocktable :block week :maxlevel 3
   #+CAPTION: Clock summary at [2020-05-31 Sun 17:09], for week 2020-W22.
   | Headline                                    | Time       |          |       |
   |---------------------------------------------+------------+----------+-------|
   | *Total time*                                | *1d 16:00* |          |       |
   |---------------------------------------------+------------+----------+-------|
   | 2020                                        | 1d 16:00   |          |       |
   | \_  Standup Tue                             |            |     0:30 |       |
   | \_  Standup Wed                             |            |     0:30 |       |
   | \_  Standup Thu                             |            |     0:30 |       |
   | \_  Standup Fri                             |            |     0:30 |       |
   | \_  Week 21                                 |            | 1d 14:00 |       |
   | \_    memorial day                          |            |          |  8:00 |
   | \_    link to station selector              |            |          |  1:00 |
   | \_    implement generic rail attachment     |            |          |  2:00 |
   | \_    add vehicles to station page          |            |          |  2:00 |
   | \_    smtp server, password reset, email... |            |          |  9:00 |
   | \_    station page                          |            |          | 16:00 |
   #+END:

*** DONE memorial day
    :LOGBOOK:
    CLOCK: [2020-05-25 Mon 07:00]--[2020-05-25 Mon 15:00] =>  8:00
    :END:

*** DONE link to station selector
    :LOGBOOK:
    CLOCK: [2020-05-25 Mon 12:00]--[2020-05-25 Mon 13:00] =>  1:00
    :END:

*** DONE implement generic rail attachment
    :LOGBOOK:
    CLOCK: [2020-05-26 Tue 07:00]--[2020-05-26 Tue 08:00] =>  1:00
    CLOCK: [2020-05-25 Mon 13:00]--[2020-05-25 Mon 14:00] =>  1:00
    :END:

*** DONE add vehicles to station page
    :LOGBOOK:
    CLOCK: [2020-05-26 Tue 08:00]--[2020-05-26 Tue 10:00] =>  2:00
    :END:

*** DONE smtp server, password reset, email confirmation
    :LOGBOOK:
    CLOCK: [2020-05-26 Tue 10:30]--[2020-05-26 Tue 16:00] =>  5:30
    CLOCK: [2020-05-27 Wed 06:30]--[2020-05-27 Wed 10:00] =>  3:30
    :END:

*** OUT station page
    :LOGBOOK:
    CLOCK: [2020-05-28 Thu 06:00]--[2020-05-28 Thu 10:00] =>  4:00
    CLOCK: [2020-05-28 Thu 10:30]--[2020-05-28 Thu 14:00] =>  3:30
    CLOCK: [2020-05-29 Fri 07:30]--[2020-05-29 Fri 10:00] =>  2:30
    CLOCK: [2020-05-29 Fri 10:30]--[2020-05-29 Fri 16:30] =>  6:00
    :END:


** Week 22

   #+BEGIN: clocktable :block week :maxlevel 3
   #+CAPTION: Clock summary at [2020-06-07 Sun 19:15], for week 2020-W23.
   | Headline                                  | Time       |          |       |
   |-------------------------------------------+------------+----------+-------|
   | *Total time*                              | *1d 16:00* |          |       |
   |-------------------------------------------+------------+----------+-------|
   | 2020                                      | 1d 16:00   |          |       |
   | \_  Standup Mon                           |            |     0:30 |       |
   | \_  Standup Tue                           |            |     0:30 |       |
   | \_  Standup Wed                           |            |     0:30 |       |
   | \_  Standup Thu                           |            |     0:30 |       |
   | \_  Standup Fri                           |            |     0:30 |       |
   | \_  Week 22                               |            | 1d 13:30 |       |
   | \_    #13 station reports front end       |            |          |  3:00 |
   | \_    #14 give station view control of... |            |          | 13:00 |
   | \_    #15 station page gui editor         |            |          | 21:30 |
   #+END:

*** DONE #13 station reports front end
    :LOGBOOK:
    CLOCK: [2020-06-01 Mon 07:00]--[2020-06-01 Mon 10:00] =>  3:00
    :END:

*** DONE #14 give station view control of station diagram code generation
    :LOGBOOK:
    CLOCK: [2020-06-03 Wed 18:00]--[2020-06-03 Wed 18:30] =>  0:30
    CLOCK: [2020-06-03 Wed 10:30]--[2020-06-03 Wed 12:30] =>  2:00
    CLOCK: [2020-06-03 Wed 07:30]--[2020-06-03 Wed 10:00] =>  2:30
    CLOCK: [2020-06-02 Tue 06:30]--[2020-06-02 Tue 10:00] =>  3:30
    CLOCK: [2020-06-01 Mon 10:30]--[2020-06-01 Mon 15:00] =>  4:30
    :END:

*** OUT #15 station page gui editor
    :LOGBOOK:
    CLOCK: [2020-06-05 Fri 07:00]--[2020-06-05 Fri 10:00] =>  3:00
    CLOCK: [2020-06-05 Fri 10:30]--[2020-06-05 Fri 13:00] =>  2:30
    CLOCK: [2020-06-05 Fri 16:00]--[2020-06-05 Fri 18:30] =>  2:30
    CLOCK: [2020-06-04 Thu 06:30]--[2020-06-04 Thu 10:00] =>  3:30
    CLOCK: [2020-06-04 Thu 10:30]--[2020-06-04 Thu 17:00] =>  6:30
    CLOCK: [2020-06-07 Sun 13:00]--[2020-06-07 Sun 16:30] =>  3:30
    :END:


** Week 23

#+BEGIN: clocktable :block lastweek :maxlevel 3
#+CAPTION: Clock summary at [2020-06-15 Mon 13:34], for week 2020-W24.
| Headline                                      | Time       |          |          |
|-----------------------------------------------+------------+----------+----------|
| *Total time*                                  | *1d 16:00* |          |          |
|-----------------------------------------------+------------+----------+----------|
| 2020                                          | 1d 16:00   |          |          |
| \_  Standup Mon                               |            |     0:30 |          |
| \_  Standup Tue                               |            |     0:30 |          |
| \_  Standup Thu                               |            |     0:30 |          |
| \_  Standup Fri                               |            |     0:30 |          |
| \_  Week 23                                   |            | 1d 14:00 |          |
| \_    #15 #24 #26 #28 station page gui editor |            |          | 1d 10:30 |
| \_    #5 pittsburgh station selector          |            |          |     3:30 |
#+END:

*** DONE #15 #24 #26 #28 station page gui editor
    :LOGBOOK:
    CLOCK: [2020-06-08 Mon 07:00]--[2020-06-08 Mon 10:00] =>  3:00
    CLOCK: [2020-06-08 Mon 10:30]--[2020-06-08 Mon 15:00] =>  4:30
    CLOCK: [2020-06-09 Tue 07:30]--[2020-06-09 Tue 10:00] =>  2:30
    CLOCK: [2020-06-09 Tue 10:30]--[2020-06-09 Tue 14:30] =>  4:00
    CLOCK: [2020-06-10 Wed 07:00]--[2020-06-10 Wed 10:00] =>  3:00
    CLOCK: [2020-06-10 Wed 10:30]--[2020-06-10 Wed 17:00] =>  6:30
    CLOCK: [2020-06-11 Thu 06:00]--[2020-06-11 Thu 10:00] =>  4:00
    CLOCK: [2020-06-11 Thu 18:00]--[2020-06-11 Thu 19:00] =>  1:00
    CLOCK: [2020-06-12 Fri 07:00]--[2020-06-12 Fri 10:00] =>  3:00
    CLOCK: [2020-06-12 Fri 10:30]--[2020-06-12 Fri 13:30] =>  3:00
    :END:

*** OUT #5 pittsburgh station selector
    :LOGBOOK:
    CLOCK: [2020-06-14 Sun 14:00]--[2020-06-14 Sun 17:30] =>  3:30
    :END:


** Week 25

#+BEGIN: clocktable :block week :maxlevel 3
#+CAPTION: Clock summary at [2020-06-21 Sun 21:59], for week 2020-W25.
| Headline                               | Time       |          |      |
|----------------------------------------+------------+----------+------|
| *Total time*                           | *1d 16:00* |          |      |
|----------------------------------------+------------+----------+------|
| 2020                                   | 1d 16:00   |          |      |
| \_  Standup Mon                        |            |     0:30 |      |
| \_  Standup Tue                        |            |     0:30 |      |
| \_  Standup Wed                        |            |     0:30 |      |
| \_  Standup Thu                        |            |     0:30 |      |
| \_  Standup Fri                        |            |     0:30 |      |
| \_  Week 22                            |            | 1d 13:30 |      |
| \_    #7 view full diagram             |            |          | 3:00 |
| \_    vfd tooltips                     |            |          | 2:00 |
| \_    service sheets                   |            |          | 9:30 |
| \_    #5 pittsburgh station selector   |            |          | 7:00 |
| \_    admin city selector              |            |          | 1:00 |
| \_    pittsburgh fire service sheets   |            |          | 1:00 |
| \_    confirm password on email change |            |          | 5:30 |
| \_    save station diagram request...  |            |          | 2:00 |
| \_    make station selector scaleable  |            |          | 6:30 |
#+END:

*** TODO #7 view full diagram
    :LOGBOOK:
    CLOCK: [2020-06-15 Mon 7:00]--[2020-06-15 Mon 10:00] =>  3:00
    :END:

*** DONE vfd tooltips
    :LOGBOOK:
    CLOCK: [2020-06-15 Mon 10:30]--[2020-06-15 Mon 12:30] =>  2:00
    :END:

*** DONE service sheets
   :LOGBOOK:
    CLOCK: [2020-06-15 Mon 12:30]--[2020-06-15 Mon 16:00] =>  3:30
    CLOCK: [2020-06-16 Tue 06:30]--[2020-06-16 Tue 10:00] =>  3:30
    CLOCK: [2020-06-16 Tue 10:30]--[2020-06-16 Tue 13:00] =>  2:30
    :END:

*** DONE #5 pittsburgh station selector
   :LOGBOOK:
    CLOCK: [2020-06-16 Tue 13:00]--[2020-06-16 Tue 13:30] =>  0:30
    CLOCK: [2020-06-17 Wed 08:00]--[2020-06-17 Wed 10:00] =>  2:00
    CLOCK: [2020-06-17 Wed 10:30]--[2020-06-17 Wed 15:00] =>  4:30
    :END:

*** DONE admin city selector
   :LOGBOOK:
    CLOCK: [2020-06-17 Wed 15:00]--[2020-06-17 Wed 16:00] =>  1:00
    :END:

*** DONE pittsburgh fire service sheets
   :LOGBOOK:
    CLOCK: [2020-06-18 Thu 06:00]--[2020-06-18 Thu 07:00] =>  1:00
    :END:

*** DONE confirm password on email change
   :LOGBOOK:
    CLOCK: [2020-06-18 Thu 07:00]--[2020-06-18 Thu 10:00] =>  3:00
    CLOCK: [2020-06-18 Thu 10:30]--[2020-06-18 Thu 13:00] =>  2:30
    :END:

*** TODO save station diagram request returning failed
   :LOGBOOK:
    CLOCK: [2020-06-19 Fri 8:00]--[2020-06-19 Fri 10:00] =>  2:00
    :END:

*** TODO make station selector scaleable
   :LOGBOOK:
    CLOCK: [2020-06-19 Fri 10:30]--[2020-06-19 Fri 14:00] =>  3:30
    CLOCK: [2020-06-21 Sun 14:00]--[2020-06-21 Sun 17:00] =>  3:00
    :END:
